# StairsRunLocationpathJustfication Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunLocationpathJustfication Property
ParameterTypeId Class See Also
---
"Location Line": Location Line
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunLocationpathJustfication { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunLocationpathJustfication As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunLocationpathJustfication {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace